Examinator/src/ChartsOfCharacteristicTypes/ПеременныеШаблоновСообщенийСУО/ПеременныеШаблоновСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ПеременныеШаблоновСообщенийСУО</name>
  <type>
    <types>DocumentRef.ПопыткаВыполненияЗаданияСУО</types>
    <types>CatalogRef.КаталогМероприятийСУО</types>
    <types>CatalogRef.ЛитератураСУО</types>
    <types>CatalogRef.АудиторииСУО</types>
    <types>Boolean</types>
    <types>CatalogRef.УчебныеГруппыСУО</types>
    <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    <types>String</types>
    <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    <types>CatalogRef.СводыЗнанийСУЗ</types>
    <types>Date</types>
    <types>Number</types>
    <types>DocumentRef.ПрохождениеОбученияСУО</types>
    <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
    <types>DocumentRef.ПроведениеОбученияСУО</types>
    <types>CatalogRef.Пользователи</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>АдресДляПерехода</name>
      <description>Адрес для перехода</description>
      <code>АдресДляПерехода</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>АдресСертификата</name>
      <description>Адрес сертификата</description>
      <code>АдресСертификата</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ДатаНачалаДоступаПользователяКБазе</name>
      <description>Дата начала доступа пользователя к базе</description>
      <code>ДатаНачалаДоступаПользователяКБазе</code>
      <type>
        <types>Date</types>
      </type>
    </items>
    <items>
      <name>ДатаНачалаПроведенияМероприятия</name>
      <description>Дата начала проведения мероприятия</description>
      <code>ДатаНачалаПроведенияМероприятия</code>
      <type>
        <types>DocumentRef.ПроведениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ДатаНачалаПроведенияПрограммыОбучения</name>
      <description>Дата начала проведения программы обучения</description>
      <code>ДатаНачалаПроведенияПрограммыОбучения</code>
      <type>
        <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ДатаНачалаПрохожденияМероприятия</name>
      <description>Дата начала прохождения мероприятия</description>
      <code>ДатаНачалаПрохожденияМероприятия</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ДатаОкончанияДоступаПользователяКБазе</name>
      <description>Дата окончания доступа пользователя к базе</description>
      <code>ДатаОкончанияДоступаПользователяКБазе</code>
      <type>
        <types>Date</types>
      </type>
    </items>
    <items>
      <name>ДатаОкончанияПроведенияМероприятия</name>
      <description>Дата окончания проведения мероприятия</description>
      <code>ДатаОкончанияПроведенияМероприятия</code>
      <type>
        <types>DocumentRef.ПроведениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ДатаОкончанияПроведенияПрограммыОбучения</name>
      <description>Дата окончания проведения программы обучения</description>
      <code>ДатаОкончанияПроведенияПрограммыОбучения</code>
      <type>
        <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ДатаОкончанияПрохожденияМероприятия</name>
      <description>Дата окончания прохождения мероприятия</description>
      <code>ДатаОкончанияПрохожденияМероприятия</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ЗавершеноВПроцентах</name>
      <description>Завершено в процентах</description>
      <code>ЗавершеноВПроцентах</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>Книга</name>
      <description>Книга</description>
      <code>Книга</code>
      <type>
        <types>CatalogRef.ЛитератураСУО</types>
      </type>
    </items>
    <items>
      <name>КодПодтверждения</name>
      <description>Код подтверждения</description>
      <code>КодПодтверждения</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>КоличествоЗавершенныхМероприятий</name>
      <description>Количество завершенных мероприятий</description>
      <code>КоличествоЗавершенныхМероприятий</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>КоличествоЗавершенныхТестов</name>
      <description>Количество завершенных тестов обучения</description>
      <code>КоличествоЗавершенныхТестов</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>КоличествоЗавершенныхЭлектронныхКурсов</name>
      <description>Количество завершенных электронных курсов обучения</description>
      <code>КоличествоЗавершенныхЭлектронныхКурсов</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>КоличествоОтправленныхНаПроверкуЗаданий</name>
      <description>Количество отправленных на проверку заданий обучения</description>
      <code>КоличествоОтправленныхНаПроверкуЗаданий</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>КоличествоПроверенныхЗаданий</name>
      <description>Количество проверенных заданий обучения</description>
      <code>КоличествоПроверенныхЗаданий</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>КоличествоСообщений</name>
      <description>Количество сообщений</description>
      <code>КоличествоСообщений</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ЛогинПользователя</name>
      <description>Логин пользователя</description>
      <code>ЛогинПользователя</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>Мероприятие</name>
      <description>Мероприятие</description>
      <code>Мероприятие</code>
      <type>
        <types>CatalogRef.КаталогМероприятийСУО</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>DocumentRef.ПроведениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>Месторасположение</name>
      <description>Месторасположение</description>
      <code>Месторасположение</code>
      <type>
        <types>CatalogRef.АудиторииСУО</types>
      </type>
    </items>
    <items>
      <name>НаименованиеЗадания</name>
      <description>Наименование задания</description>
      <code>НаименованиеЗадания</code>
      <type>
        <types>DocumentRef.ПопыткаВыполненияЗаданияСУО</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
      </type>
    </items>
    <items>
      <name>НаименованиеОбучения</name>
      <description>Наименование обучения</description>
      <code>НаименованиеОбучения</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
        <types>DocumentRef.ПроведениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>НаименованиеПрограммыОбучения</name>
      <description>Наименование программы обучения</description>
      <code>НаименованиеПрограммыОбучения</code>
      <type>
        <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
        <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>НовыйПароль</name>
      <description>Новый пароль</description>
      <code>НовыйПароль</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ОбъединенныеЛогины</name>
      <description>Объединенные логины</description>
      <code>ОбъединенныеЛогины</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ОценкаЗаЗадание</name>
      <description>Оценка за задание</description>
      <code>ОценкаЗаЗадание</code>
      <type>
        <types>DocumentRef.ПопыткаВыполненияЗаданияСУО</types>
      </type>
    </items>
    <items>
      <name>ОценкаЗаОбучение</name>
      <description>Оценка за обучение</description>
      <code>ОценкаЗаОбучение</code>
      <type>
        <types>DocumentRef.ПрохождениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ПинКод</name>
      <description>Пин-код</description>
      <code>ПинКод</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>Пользователь</name>
      <description>Пользователь</description>
      <code>Пользователь</code>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </items>
    <items>
      <name>ПрограммаОбучения</name>
      <description>Программа обучения</description>
      <code>ПрограммаОбучения</code>
      <type>
        <types>CatalogRef.КаталогПрограммОбученияСУО</types>
        <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ПродолжительностьОбучения</name>
      <description>Продолжительность обучения</description>
      <code>ПродолжительностьОбучения</code>
      <type>
        <types>DocumentRef.ПроведениеОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>ПродолжительностьПрограммыОбучения</name>
      <description>Продолжительность программы обучения</description>
      <code>ПродолжительностьПрограммыОбучения</code>
      <type>
        <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
      </type>
    </items>
    <items>
      <name>УчебнаяГруппа</name>
      <description>Учебная группа</description>
      <code>УчебнаяГруппа</code>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Examinator/src/ChartsOfCharacteristicTypes/ПеременныеШаблоновСообщенийСУО/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоРасширеннаяФункциональность = ПолучитьФункциональнуюОпцию("РасширеннаяФункциональностьСУО");
	
	ИсключенныеПеременные = Новый Массив;
	
	Если НЕ ЭтоРасширеннаяФункциональность Тогда
		ИсключенныеПеременные.Добавить(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Книга);
		ИсключенныеПеременные.Добавить(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.КоличествоЗавершенныхМероприятий);
		ИсключенныеПеременные.Добавить(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Мероприятие);
		ИсключенныеПеременные.Добавить(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.Месторасположение);
		ИсключенныеПеременные.Добавить(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПинКод);
		ИсключенныеПеременные.Добавить(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПрограммаОбучения);
		ИсключенныеПеременные.Добавить(ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПродолжительностьПрограммыОбучения);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеременныеШаблоновСообщенийСУО.Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.ПеременныеШаблоновСообщенийСУО КАК ПеременныеШаблоновСообщенийСУО
		|ГДЕ
		|	НЕ ПеременныеШаблоновСообщенийСУО.Ссылка В (&МассивИсключенных)";
	
	Запрос.Параметры.Вставить("МассивИсключенных", ИсключенныеПеременные);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Переменные.Добавить();
		НоваяСтрока.Переменная = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Подсказка = ПланыВидовХарактеристик.ПеременныеШаблоновСообщенийСУО.ПодсказкаКПеременной(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыПеременные

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Переменные

&НаКлиенте
Процедура ПеременныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ОповеститьОВыборе(Элемент.ТекущиеДанные.Переменная);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПеременную(Команда)
	Если Элементы.Переменные.ТекущиеДанные <> Неопределено Тогда
		ОповеститьОВыборе(Элементы.Переменные.ТекущиеДанные.Переменная);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
